## production: ecs
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`




**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!


```terraform
Plan: 2 to add, 2 to change, 2 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.masked_inapp_metrics.aws_cloudwatch_event_target.ecs_scheduled_task will be updated in-place
  ~ resource "aws_cloudwatch_event_target" "ecs_scheduled_task" {
        id             = "masked_inapp_metrics_event_rule-terraform-20210709161928461300000003"
      - input          = jsonencode({}) -> null
        # (5 unchanged attributes hidden)

      ~ ecs_target {
          + propagate_tags          = "TASK_DEFINITION"
            tags                    = {}
          ~ task_definition_arn     = "arn:aws:ecs:ca-central-1:820252213580:task-definition/masked_inapp_metrics:3" -> (known after apply)
            # (5 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
    }

  # module.masked_inapp_metrics.aws_ecs_task_definition.task_def must be replaced
-/+ resource "aws_ecs_task_definition" "task_def" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:820252213580:task-definition/masked_inapp_metrics:3" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  - cpu              = 0 -> null
                  - essential        = true -> null
                  - mountPoints      = [] -> null
                  ~ portMappings     = [
                      ~ {
                          - hostPort      = 8001 -> null
                          - protocol      = "tcp" -> null
                            # (1 unchanged element hidden)
                        },
                    ]
                  - volumesFrom      = [] -> null
                    # (6 unchanged elements hidden)
                },
            ]
        )
      ~ cpu                      = "2048" -> "4096" # forces replacement
      ~ id                       = "masked_inapp_metrics" -> (known after apply)
      ~ memory                   = "16384" -> "30720" # forces replacement
      ~ revision                 = 3 -> (known after apply)
        tags                     = {
            "CostCentre" = "CovidShield"
        }
        # (6 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

  # module.unmasked_inapp_metrics.aws_cloudwatch_event_target.ecs_scheduled_task will be updated in-place
  ~ resource "aws_cloudwatch_event_target" "ecs_scheduled_task" {
        id             = "unmasked_inapp_metrics_event_rule-terraform-20210709161928511000000004"
        # (5 unchanged attributes hidden)

      ~ ecs_target {
            tags                    = {}
          ~ task_definition_arn     = "arn:aws:ecs:ca-central-1:820252213580:task-definition/unmasked_inapp_metrics:3" -> (known after apply)
            # (6 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
    }

  # module.unmasked_inapp_metrics.aws_ecs_task_definition.task_def must be replaced
-/+ resource "aws_ecs_task_definition" "task_def" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:820252213580:task-definition/unmasked_inapp_metrics:3" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  - cpu              = 0 -> null
                  - essential        = true -> null
                  - mountPoints      = [] -> null
                  ~ portMappings     = [
                      ~ {
                          - hostPort      = 8001 -> null
                          - protocol      = "tcp" -> null
                            # (1 unchanged element hidden)
                        },
                    ]
                  - volumesFrom      = [] -> null
                    # (6 unchanged elements hidden)
                },
            ]
        )
      ~ cpu                      = "2048" -> "4096" # forces replacement
      ~ id                       = "unmasked_inapp_metrics" -> (known after apply)
      ~ memory                   = "16384" -> "30720" # forces replacement
      ~ revision                 = 3 -> (known after apply)
        tags                     = {
            "CostCentre" = "CovidShield"
        }
        # (6 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

Plan: 2 to add, 2 to change, 2 to destroy.

------------------------------------------------------------------------

This plan was saved to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

Releasing state lock. This may take a few moments...

```

</details>